
# Задание №1 (easy)


# a = 19
# print(a)

# b = 'Коз'
# с = 'л'
# d = 'одоев'
# print(b + d)

# name = input('Как Вас зовут? ')
# print('Очень приятно, ' + name)


# Задание №2 (easy)


# number = int(input('Введите любую цифру, отличную от нуля '))
# if number > 9 or number <= 0:
#     print('Вы ввели число или ноль. Больше попыток нет. :)')
# else:
#     e = number + 2
#     print('Если добавить 2, будет -', e)


# Задание №3 (easy)


# age = int(input ('Сколько Вам лет? '))
# if age >= 18:
#     print('Доступ разрешен')
# else:
#     print('Пока Вам сюда нельзя =(')


# Задание №1 (normal)


# number = int(input('Введите целое число больше нуля и меньше 10: '))
# while number <= 0 or number >=10:
#     number = int(input('Вы ввели неверное число. Введите целое число больше нуля и меньше 10: '))
# e = number ** 2
# print(e)


# Задание №2 (normal)

# a

# one = input('Введите две буквы:') #например, КУ
# two = one
# one = input('Введите две буквы:') #например, БА
# print(one + two)

# b

# a = int(input('Введите число_'))
# b = int(input('Введите еще число_'))
# a = a + b
# b = a - b
# a = a - b
# print(a, b)


# Задание №1 (hard)

# name = input('Ваше имя: ')
# surname = input('Ваша фамилия: ')
# age = int(input('Ваш возраст: '))
# if 180 >= age >= 18:
#     w = int(input('Ваш вес: '))
#     if age <= 30 and 50 <= w <= 120:
#         print('Вы в хорошем состоянии')
#     elif 40 >= age > 30 and (w > 120 or w < 50):
#         print('Вам следует заняться собой')
#     elif age > 40 and (w > 120 or w < 50):
#         print('Вам требуется врачебный осмотр')
#     else:
#         print('Рекомендовано правильное питание и морской воздух')
# else:
#     print('Вы не подходите для анкетирования')



